Hello @jharshman

I tried your example, and I wasn't able to reproduce the problem. 

From my setup:
```
 # kubernetes_manifest.ksm_pod_monitor will be created
  + resource "kubernetes_manifest" "ksm_pod_monitor" {
      + manifest = {
          + apiVersion = "monitoring.gke.io/v1alpha1"
          + kind       = "PodMonitor"
          + metadata   = {
              + name      = "ksm-pod-monitor"
              + namespace = "kube-state-metrics"
            }
          + spec       = {
              + namespaceSelector   = {
                  + matchNames = [
                      + "kube-state-metrics",
                    ]
                }
              + podMetricsEndpoints = [
                  + {
                      + path   = "/metrics"
                      + port   = "http-metrics"
                      + scheme = "http"
                    },
                ]
              + selector            = {
                  + matchLabels = {
                      + app = "kube-state-metrics"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "monitoring.gke.io/v1alpha1"
          + kind       = "PodMonitor"
          + metadata   = {
              + name      = "ksm-pod-monitor"
              + namespace = "kube-state-metrics"
            }
          + spec       = {
              + namespaceSelector   = {
                  + any        = (known after apply)
                  + matchNames = [
                      + "kube-state-metrics",
                    ]
                }
              + podMetricsEndpoints = [
                  + {
                      + interval          = (known after apply)
                      + metricRelabelings = (known after apply)
                      + path              = "/metrics"
                      + port              = "http-metrics"
                      + scheme            = "http"
                      + scrapeTimeout     = (known after apply)
                    },
                ]
              + selector            = {
                  + matchExpressions = (known after apply)
                  + matchLabels      = {
                      + "app" = "kube-state-metrics"
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_manifest.ksm_pod_monitor: Creating...
kubernetes_manifest.ksm_pod_monitor: Creation complete after 1s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

From my cluster:
```
> kubectl get apiservices |grep 'gke'
v1.networking.gke.io                        Local                                               True        28m
v1alpha1.monitoring.gke.io                  Local                                               True        28m
v1alpha1.nodemanagement.gke.io              Local                                               True        28m
v1beta1.autoscaling.gke.io                  Local                                               True        28m
v1beta1.networking.gke.io                   Local                                               True        28m
v1beta2.networking.gke.io                   Local                                               True        28m
```
```
> terraform version
Terraform v1.0.5
on darwin_amd64
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
```
```
> kubectl version
Client Version: version.Info{Major:"1", Minor:"22", GitVersion:"v1.22.2", GitCommit:"8b5a19147530eaac9476b0ab82980b4088bbc1b2", GitTreeState:"clean", BuildDate:"2021-09-15T21:31:32Z", GoVersion:"go1.16.8", Compiler:"gc", Platform:"darwin/amd64"}
Server Version: version.Info{Major:"1", Minor:"20+", GitVersion:"v1.20.9-gke.1001", GitCommit:"1fe18c314ed577f6047d2712a9d1c8e498e22381", GitTreeState:"clean", BuildDate:"2021-08-23T23:06:28Z", GoVersion:"go1.15.13b5", Compiler:"gc", Platform:"linux/amd64"}
WARNING: version difference between client (1.22) and server (1.20) exceeds the supported minor version skew of +/-1

```

Also, notice this part of your error `The error `no matches for kind "PodMonitor" in group "monitoring.gke.io"``

Can you double check that pod monitoring is installed with `kubectl get apiservices | grep 'gke'`?  It look around 30 minutes for my pod monitoring services to become available.

Thanks and take care!


